{
  "common.actions": "Actions",
  "common.cancel": "Cancel",
  "common.confirm": "Confirm",
  "common.confirmDeletion": "Confirm Deletion",
  "common.copied": "Copied to clipboard",
  "common.copyMessage": "Copied to clipboard!",
  "common.delete": "Delete",
  "common.details": "Details",
  "common.itemsPerPage": "Items per page",
  "common.new.template": "New Template",
  "common.noOptions": "No options found.",
  "common.outputFormatPlaceholder": "Output Format...",
  "common.search": "Search...",
  "common.searchPlaceholder": "Search...",
  "common.selectPlaceholder": "Select...",
  "common.status": "Status",
  "common.tooltipCopyText": "Click to copy",
  "error.database.duplicatedMenu": "Menu already registered",
  "error.database.invalidObject": "Invalid object id",
  "error.database.notFound": "Not found",
  "error.database.unexpected": "Unexpected error",
  "error.database.validationFailed": "Validation failed",
  "error.login": "Invalid credentials",
  "error.midaz.unknowError": "Unknown error on Midaz.",
  "error.query.title": "Server Error",
  "error.smartTemplates.unknownError": "Unknown error occurred in Smart Templates service.",
  "errors.auth.enforcementSubNotFound": "No subject was found for the provided 'sub'. Please refer to the enforcement documentation for guidance on the correct 'sub' value.",
  "errors.auth.grantTypeMissingFields": "The provided 'grant_type' is missing required fields. Please refer to the documentation for guidance.",
  "errors.auth.internalServerError": "The server encountered an unexpected error. Please try again later or contact support.",
  "errors.auth.invalidClient": "The provided 'clientId' or 'clientSecret' is incorrect. Please verify the credentials and try again.",
  "errors.auth.invalidGrantType": "The provided 'grantType' is not valid. Accepted grant types are password, client_credentials, refresh_token, or others. Please provide a valid type.",
  "errors.auth.invalidMetadataNesting": "The metadata object cannot contain nested values. Please ensure that the value is not nested and try again.",
  "errors.auth.invalidPathParameter": "One or more path parameters are in an incorrect format. Please check the parameters and ensure they meet the required format before trying again.",
  "errors.auth.invalidQueryParameter": "One or more query parameters are in an incorrect format. Please check the parameters and ensure they meet the required format before trying again.",
  "errors.auth.invalidRefreshToken": "The provided 'refreshToken' is invalid, expired or revoked. Please verify the token and try again.",
  "errors.auth.invalidToken": "The provided token is expired, invalid or malformed. Please provide a valid token and try again.",
  "errors.auth.invalidUsernameOrPassword": "The provided 'username' or 'password' is incorrect. Please verify the credentials and try again.",
  "errors.auth.metadataKeyLengthExceeded": "The metadata key exceeds the maximum allowed length of characters. Please use a shorter key.",
  "errors.auth.metadataValueLengthExceeded": "The metadata value exceeds the maximum allowed length of characters. Please use a shorter value.",
  "errors.auth.permissionEnforcementError": "The enforcer is not configured properly. Please contact your administrator if you believe this is an error.",
  "errors.auth.tokenMissing": "A valid token must be provided in the request header. Please include a token and try again.",
  "errors.auth.unsupportedGrantType": "The provided 'grantType' is not supported by this application. Please refer to the application's supported grant types.",
  "errors.custom.date.invalid": "Invalid date",
  "errors.custom.one_lowercase_letter": "Field must contain at least 1 lowercase letter",
  "errors.custom.one_number": "Field must contain at least 1 number",
  "errors.custom.one_uppercase_letter": "Field must contain at least 1 uppercase letter",
  "errors.custom.only_numbers": "Field must contain only numbers",
  "errors.custom.special_characters": "Field must not contain special characters",
  "errors.custom.uppercase_required": "Field must be in uppercase and consist of letters only",
  "errors.invalid_type": "",
  "errors.invalid_type_received_undefined": "Required field",
  "errors.midaz.accountAliasNotFound": "The provided account Alias does not exist in our records. Please verify the account Alias and try again.",
  "errors.midaz.accountBalanceDeletionError": "An account or sub-account cannot be deleted if it has a remaining balance. Please ensure all remaining balances are transferred to another account before attempting to delete.",
  "errors.midaz.accountIdNotFound": "The provided account ID does not exist in our records. Please verify the account ID and try again.",
  "errors.midaz.accountIneligibilityError": "One or more accounts listed in the transaction are not eligible to participate. Please review the account statuses and try again.",
  "errors.midaz.accountStatusTransactionRestriction": "The current statuses of the source and/or destination accounts do not permit transactions. Change the account status(es) and try again.",
  "errors.midaz.accountTypeImmutable": "The account type specified cannot be modified. Please ensure the correct account type is being used and try again.",
  "errors.midaz.actionNotPermitted": "The action you are attempting is not allowed in the current environment. Please refer to the documentation for guidance.",
  "errors.midaz.aliasUnavailabilityError": "The alias is already in use. Please choose a different alias and try again.",
  "errors.midaz.assetCodeNotFound": "The provided asset code does not exist in our records. Please verify the asset code and try again.",
  "errors.midaz.assetIdNotFound": "The provided asset ID does not exist in our records. Please verify the asset ID and try again.",
  "errors.midaz.assetNameOrCodeDuplicate": "An asset with the same name or code already exists in your ledger. Please modify the name or code of your new asset.",
  "errors.midaz.badRequest": "The server could not understand the request due to malformed syntax. Please check the listed fields and try again.",
  "errors.midaz.balanceCannotBeDeleted": "Balance cannot be deleted because it still has funds in it.",
  "errors.midaz.balanceRemainingDeletionError": "The asset cannot be deleted because there is a remaining balance. Please ensure all balances are cleared before attempting to delete again.",
  "errors.midaz.balanceUpdateFailed": "The balance could not be updated for the specified account ID. Please verify the account ID and try again.",
  "errors.midaz.chartTypeNotFound": "The chart type does not exist. Please provide a valid chart type and refer to the documentation if you have any questions.",
  "errors.midaz.codeUpperCaseRequirement": "The code must be in uppercase. Please ensure that the code is in uppercase format and try again.",
  "errors.midaz.currencyCodeStandardCompliance": "Currency-type assets must comply with the ISO-4217 standard. Please use a currency code that conforms to ISO-4217 guidelines.",
  "errors.midaz.dateRangeExceedsLimitError": "The range between 'initialDate' and 'finalDate' exceeds the permitted limit of months. Please adjust the dates and try again.",
  "errors.midaz.duplicateAssetPairError": "A pair for the assets already exists. Please update the existing entry instead of creating a new one.",
  "errors.midaz.duplicateIdempotencyKey": "The idempotency key is already in use. Please provide a unique key and try again.",
  "errors.midaz.duplicateLedgerName": "A ledger with this name already exists in the organization. Please rename the ledger or choose a different organization to attach it to.",
  "errors.midaz.duplicateSegmentNameError": "A segment with this name already exists for this ledger. Please try again with a different ledger or name.",
  "errors.midaz.duplicateTransactionTemplateCodeError": "A transaction template with the this code already exists for your ledger. Please use a different code and try again.",
  "errors.midaz.entityNotFound": "No entity was found for the given ID. Please make sure to use the correct ID for the entity you are trying to manage.",
  "errors.midaz.externalAccountModificationProhibited": "Accounts of type 'external' cannot be deleted or modified as they are used for traceability with external systems. Please review your request and ensure operations are only performed on internal accounts.",
  "errors.midaz.failedToRetrieveAccountsByAliases": "The accounts could not be retrieved using the specified aliases. Please verify the aliases for accuracy and try again.",
  "errors.midaz.idCannotBeUsedAsParentId": "The provided ID cannot be used as the parent ID. Please choose a different one.",
  "errors.midaz.immutableFieldError": "The field cannot be modified. Please remove this field from your request and try again.",
  "errors.midaz.inactiveAccountTypeError": "The account type specified cannot be set to INACTIVE. Please ensure the correct account type is being used and try again.",
  "errors.midaz.insufficientAccountBalanceError": "The account does not have sufficient balance. Please try again with an amount that is less than or equal to the available balance.",
  "errors.midaz.insufficientFundsError": "The transaction could not be completed due to insufficient funds in the account. Please add sufficient funds to your account and try again.",
  "errors.midaz.insufficientPrivileges": "You do not have the necessary permissions to perform this action. Please contact your administrator if you believe this is an error.",
  "errors.midaz.internalServerError": "The server encountered an unexpected error. Please try again later or contact support.",
  "errors.midaz.invalidAccountAlias": "The alias contains invalid characters. Please verify the alias value and try again.",
  "errors.midaz.invalidAccountType": "The provided 'type' is not valid. Accepted types are: deposit, savings, loans, marketplace, creditCard or external. Please provide a valid type.",
  "errors.midaz.invalidCodeFormat": "The 'code' field must be alphanumeric, in upper case, and must contain at least one letter. Please provide a valid code.",
  "errors.midaz.invalidCountryCode": "The provided country code in the 'address.country' field does not conform to the ISO-3166 alpha-2 standard. Please provide a valid alpha-2 country code.",
  "errors.midaz.invalidDateFormatError": "The 'initialDate', 'finalDate', or both are in the incorrect format. Please use the 'yyyy-mm-dd' format and try again.",
  "errors.midaz.invalidDateRangeError": "Both 'initialDate' and 'finalDate' fields are required and must be in the 'yyyy-mm-dd' format. Please provide valid dates and try again.",
  "errors.midaz.invalidFinalDateError": "The 'finalDate' cannot be earlier than the 'initialDate'. Please verify the dates and try again.",
  "errors.midaz.invalidMetadataNesting": "The metadata object cannot contain nested values. Please ensure that the value is not nested and try again.",
  "errors.midaz.invalidParentAccountId": "The specified parent account ID does not exist. Please verify the ID is correct and try your request again.",
  "errors.midaz.invalidPathParameter": "The provided path parameter is not in the expected format. Please ensure the parameter adheres to the required format and try again.",
  "errors.midaz.invalidQueryParameter": "One or more query parameters are in an incorrect format. Ensure they meet the required format before trying again.",
  "errors.midaz.invalidScriptFormatError": "The script provided in your request is invalid or in an unsupported format. Please verify the script format and try again.",
  "errors.midaz.invalidSortOrder": "The 'sort_order' field must be 'asc' or 'desc'. Please provide a valid sort order and try again.",
  "errors.midaz.invalidToken": "The provided token is invalid or malformed. Please provide a valid token and try again.",
  "errors.midaz.invalidType": "The provided 'type' is not valid. Accepted types are: currency, crypto, commodities, or others. Please provide a valid type.",
  "errors.midaz.ledgerIdNotFound": "The provided ledger ID does not exist in our records. Please verify the ledger ID and try again.",
  "errors.midaz.ledgerNameConflict": "A ledger with this name already exists in the organization. Please rename the ledger or choose a different organization to attach it to.",
  "errors.midaz.messageBrokerUnavailable": "The server encountered an unexpected error while connecting to Message Broker. Please try again later or contact support.",
  "errors.midaz.metadataKeyLengthExceeded": "The metadata key exceeds the maximum allowed length of 100 characters. Please use a shorter key.",
  "errors.midaz.metadataValueLengthExceeded": "The metadata value exceeds the maximum allowed length of 100 characters. Please use a shorter value.",
  "errors.midaz.mismatchedAssetCode": "The parent account ID you provided is associated with a different asset code than the one specified in your request. Please make sure the asset code matches that of the parent account, or use a different parent account ID and try again.",
  "errors.midaz.missingFieldsInRequest": "Your request is missing one or more required fields. Please refer to the documentation to ensure all necessary fields are included in your request.",
  "errors.midaz.noAccountIdsProvided": "No account IDs were provided for the balance update. Please provide valid account IDs and try again.",
  "errors.midaz.noAccountsFound": "No accounts were found for the provided account IDs. Please verify the account IDs and try again.",
  "errors.midaz.noAccountsFoundSearch": "No accounts were found in the search. Please review the search criteria and try again.",
  "errors.midaz.noAssetsFound": "No assets were found in the search. Please review the search criteria and try again.",
  "errors.midaz.noLedgersFound": "No ledgers were found in the search. Please review the search criteria and try again.",
  "errors.midaz.noOperationsFound": "No operations were found in the search. Please review the search criteria and try again.",
  "errors.midaz.noOrganizationsFound": "No organizations were found in the search. Please review the search criteria and try again.",
  "errors.midaz.noPortfoliosFound": "No portfolios were found in the search. Please review the search criteria and try again.",
  "errors.midaz.noSegmentsFound": "No segments were found in the search. Please review the search criteria and try again.",
  "errors.midaz.noTransactionsFound": "No transactions were found in the search. Please review the search criteria and try again.",
  "errors.midaz.operationIdNotFound": "The provided operation ID does not exist in our records. Please verify the operation ID and try again.",
  "errors.midaz.organizationIdNotFound": "The provided organization ID does not exist in our records. Please verify the organization ID and try again.",
  "errors.midaz.overflowError": "The request could not be completed due to an overflow. Please check the values, and try again.",
  "errors.midaz.paginationLimitExceeded": "The pagination limit exceeds the maximum allowed of items per page. Please verify the limit and try again.",
  "errors.midaz.parentOrganizationIdNotFound": "The provided parent organization ID does not exist in our records. Please verify the parent organization ID and try again.",
  "errors.midaz.parentTransactionIdNotFound": "The parentTransactionId does not correspond to any existing transaction. Please review the ID and try again.",
  "errors.midaz.permissionEnforcementError": "The enforcer is not configured properly. Please contact your administrator if you believe this is an error.",
  "errors.midaz.portfolioIdNotFound": "The provided portfolio ID does not exist in our records. Please verify the portfolio ID and try again.",
  "errors.midaz.raceConditioningDetected": "A race condition was detected while processing your request. Please try again.",
  "errors.midaz.resourceAlreadyDeleted": "The resource you are trying to delete has already been deleted. Ensure you are using the correct ID and try again.",
  "errors.midaz.segmentIdInactive": "The Segment ID you are attempting to use is inactive. Please use another Segment ID and try again.",
  "errors.midaz.segmentIdNotFound": "The provided segment ID does not exist in our records. Please verify the segment ID and try again.",
  "errors.midaz.tokenExpired": "The provided token has expired. Please provide a valid token and try again.",
  "errors.midaz.tokenMissing": "A valid token must be provided in the request header. Please include a token and try again.",
  "errors.midaz.transactionAmbiguousAccount": "Transaction can't use same account in sources and destinations.",
  "errors.midaz.transactionCantBeReverted": "Transaction can't be reverted. Please try again.",
  "errors.midaz.transactionIdNotFound": "The provided transaction ID does not exist in our records. Please verify the transaction ID and try again.",
  "errors.midaz.transactionIsAlreadyReversal": "Transaction is already a reversal. Please try again.",
  "errors.midaz.transactionMethodRestriction": "Transactions involving this asset code are not permitted for the specified source and/or destination. Please try again using accounts that allow transactions with the asset code.",
  "errors.midaz.transactionRevertAlreadyExist": "Transaction revert already exists. Please try again.",
  "errors.midaz.transactionValueMismatch": "The values for the source, the destination, or both do not match the specified transaction amount. Please verify the values and try again.",
  "errors.midaz.unexpectedFieldsInTheRequest": "The request body contains more fields than expected. Please send only the allowed fields as per the documentation. The unexpected fields are listed in the fields object.",
  "errors.midaz.unmodifiableFieldError": "Your request includes a field that cannot be modified. Please review your request and try again, removing any uneditable fields. Please refer to the documentation for guidance.",
  "errors.template.file.empty": "File cannot be empty",
  "errors.template.file.invalid_extension": "File must be a .tpl template file",
  "errors.template.file.required": "Template file is required",
  "errors.template.file.too_large": "File size must be less than 5MB",
  "errors.too_big.date.exact": "Date must be exactly {maximum}",
  "errors.too_big.date.inclusive": "Date must be before or equal to {maximum}",
  "errors.too_big.date.not_inclusive": "Date must be before {maximum}",
  "errors.too_big.number.inclusive": "Field must be less than or equal to {maximum}",
  "errors.too_big.string.exact": "Field must contain exactly {maximum} {maximum, plural, =0 {characters} one {character} other {characters}}",
  "errors.too_big.string.inclusive": "Field must contain at most {maximum} {maximum, plural, =0 {characters} one {character} other {characters}}",
  "errors.too_big.string.not_inclusive": "Field must contain under {maximum} {maximum, plural, =0 {characters} one {character} other {characters}}",
  "errors.too_small.date.exact": "Date must be exactly {minimum}",
  "errors.too_small.date.inclusive": "Date must be after or equal to {minimum}",
  "errors.too_small.date.not_inclusive": "Date must be after {minimum}",
  "errors.too_small.number.not_inclusive": "Field must be greater than {minimum}",
  "errors.too_small.string.exact": "Field must contain exactly {minimum} {minimum, plural, =0 {characters} one {character} other {characters}}",
  "errors.too_small.string.inclusive": "Field must contain at least {minimum} {minimum, plural, =0 {characters} one {character} other {characters}}",
  "errors.too_small.string.not_inclusive": "Field must contain over {minimum} {minimum, plural, =0 {characters} one {character} other {characters}}",
  "fileInput.chooseFile": "Choose File",
  "fileInput.fileSize.bytes": "{bytes} B",
  "fileInput.fileSize.kilobytes": "{kb} KB",
  "fileInput.fileSize.megabytes": "{mb} MB",
  "fileInput.noFileChosen": "No file chosen",
  "notAuthorized.backToHome": "Back to Home",
  "notAuthorized.title": "You are not authorized to access this page.",
  "notFound.backToHome": "Back to Home",
  "notFound.description": "Try accessing another page.",
  "notFound.title": "The page you are looking for does not exist.",
  "notFoundContent.goBack": "Go Back",
  "reports.actions.download": "Download Report",
  "reports.actions.downloadNotAvailable": "Download Not Available",
  "reports.actions.downloadSuccess": "Report downloaded successfully",
  "reports.actions.newReport": "New Report",
  "reports.actions.viewModeGrid": "Switch to grid view",
  "reports.actions.viewModeTable": "Switch to table view",
  "reports.create.success": "New Report successfully started",
  "reports.download.success.description": "Your report has been downloaded successfully.",
  "reports.download.success.title": "Download Completed",
  "reports.downloading": "Downloading...",
  "reports.empty.action": "New Report",
  "reports.empty.description": "Generate your first report from a template to get started.",
  "reports.empty.message": "You haven't created any reports yet",
  "reports.empty.title": "No reports yet",
  "reports.filters.database": "Database",
  "reports.filters.database.tooltip": "Select the database to filter from",
  "reports.filters.description": "Define the filtering criteria applied to the data used in the report",
  "reports.filters.field": "Field",
  "reports.filters.field.tooltip": "Select the field to filter by",
  "reports.filters.table": "Table",
  "reports.filters.table.tooltip": "Select the table to filter from",
  "reports.filters.values": "Values",
  "reports.filters.values.description": "Use comma separation to indicate multiple values",
  "reports.filters.values.tooltip": "Enter the values to filter by",
  "reports.form.generateButton": "Generate Report",
  "reports.form.ledgerIds": "Ledger IDs",
  "reports.form.ledgerIds.description": "Use comma separation to indicate multiple values",
  "reports.form.ledgerIds.tooltip": "Enter ledger IDs for the report",
  "reports.form.mandatoryFields": "(*) mandatory fields",
  "reports.form.template": "Select template",
  "reports.form.template.tooltip": "Choose a template for report generation",
  "reports.loading": "Loading reports...",
  "reports.pagination.info": "Showing {count} {count, plural, one {report} other {reports}}.",
  "reports.sheet.description": "Upload a template file and configure its settings fr report generation.",
  "reports.sheet.tab.details": "Report Details",
  "reports.sheet.tab.filters": "Filters",
  "reports.sheet.title": "New Report",
  "reports.status.failed": "Failed",
  "reports.status.finished": "Finished",
  "reports.status.processing": "Processing",
  "reports.subtitle": "Create and manage reports, the output of data processing through templates.",
  "reports.table.completedAt": "Completed At",
  "reports.table.format": "Format",
  "reports.table.name": "Name",
  "reports.table.reportId": "Report ID",
  "reports.table.status": "Status",
  "reports.title": "Reports",
  "reports.tooltip": "Reports are generated documents that transform your ledger data using templates. You can create reports for compliance, analytics, or data export purposes.",
  "smartTemplates.about.description": "Generate dynamic, data-driven reports using plain-text templates (.tpl). Smart Templates use simple placeholders to pull data directly from the database and renders reports in CSV, XML, HTML, or TXT, always matching the structure defined in the original file.",
  "smartTemplates.about.dismiss": "Dismiss",
  "smartTemplates.about.readDocs": "Read the Docs",
  "smartTemplates.about.title": "About Smart Template",
  "smartTemplates.breadcrumb.overview": "Overview",
  "smartTemplates.breadcrumb.reports": "Reports",
  "smartTemplates.breadcrumb.smartTemplates": "Smart Templates",
  "smartTemplates.breadcrumb.templates": "Templates",
  "smartTemplates.cards.docs.action": "Read the Docs",
  "smartTemplates.cards.docs.description": "Need help or additional documentation? We're here to help.",
  "smartTemplates.cards.docs.title": "Smart Template Docs",
  "smartTemplates.cards.reports.action": "Manage Reports",
  "smartTemplates.cards.reports.description": "Here are the reports, the output of data processing through templates.",
  "smartTemplates.cards.reports.title": "Reports",
  "smartTemplates.cards.templates.action": "Manage Templates",
  "smartTemplates.cards.templates.description": "Here are the templates you've created and loaded into the Plugin domain.",
  "smartTemplates.cards.templates.title": "Templates",
  "smartTemplates.header.about": "About",
  "smartTemplates.tabs.overview": "Overview",
  "smartTemplates.tabs.reports": "Reports",
  "smartTemplates.tabs.templates": "Templates",
  "smartTemplates.title": "Smart Templates",
  "table.pagination.next": "Next",
  "table.pagination.previous": "Previous",
  "table.toast.copyId": "The id has been copied to your clipboard.",
  "templates.create.success": "New Template {name} successfully created",
  "templates.delete.description": "Are you sure you want to delete the template \"{fileName}\"? This action cannot be undone.",
  "templates.delete.success": "Template deleted successfully",
  "templates.emptyState.description": "You haven't created any templates yet. Create your first template to get started.",
  "templates.emptyState.title": "No templates found",
  "templates.field.lastModified": "Last Modified",
  "templates.field.name": "Name",
  "templates.field.type": "Type",
  "templates.form.mandatoryFields": "(*) mandatory fields",
  "templates.form.outputFormat": "Output Formats",
  "templates.form.outputFormat.description": "Select the output format.",
  "templates.form.outputFormat.tooltip": "Defines the output format for the generated report, like HTML, TXT, etc.",
  "templates.form.saveButton": "Save",
  "templates.form.templateFile": "Template File (.tpl)",
  "templates.form.templateFile.description": "Upload a template file with your business logic and formatting.",
  "templates.form.templateFile.tooltip": "Upload a template file with your business logic and formatting",
  "templates.form.templateName": "Template Name",
  "templates.form.templateName.tooltip": "Enter a descriptive name for your template",
  "templates.listingTemplate.addButton": "New Template",
  "templates.sheet.description": "Upload a template file and configure its settings for report generation.",
  "templates.sheet.title": "Template Details",
  "templates.showing": "{number, plural, =0 {No templates found} one {Showing {count} template} other {Showing {count} templates}}.",
  "templates.subtitle": "Manage your report templates and their configurations.",
  "templates.title": "Templates",
  "templates.tooltip": "Templates are pre-configured report structures that help you standardize and automate how data is presented. You can define layouts, formats, and parameters to streamline report generation and ensure consistency.",
  "templates.update.success": "Template {name} successfully updated"
}