{
  "common.copyMessage": "Copiado para a área de transferência!",
  "common.tooltipCopyText": "Toque para copiar",
  "common.selectPlaceholder": "Selecione...",
  "error.midaz.unknowError": "Erro no Midaz, por favor, entre em contato com o suporte.",
  "common.status": "Status",
  "common.cancel": "Cancelar",
  "common.confirm": "Confirmar",
  "errors.custom.date.invalid": "Data inválida",
  "errors.custom.one_lowercase_letter": "Campo deve conter pelo menos 1 letra minúscula",
  "errors.custom.one_number": "Campo deve conter pelo menos 1 número",
  "errors.custom.one_uppercase_letter": "Campo deve conter pelo menos 1 letra maiúscula",
  "errors.custom.special_characters": "Campo não deve conter caracteres especiais",
  "errors.invalid_type": "",
  "errors.invalid_type_received_undefined": "Campo obrigatório",
  "errors.too_big.date.exact": "Data deve ser exatamente {maximum}",
  "errors.too_big.date.inclusive": "Data deve ser anterior ou igual a {maximum}",
  "errors.too_big.date.not_inclusive": "Data deve ser anterior a {maximum}",
  "errors.too_big.string.exact": "Campo deve conter exatamente {maximum} {maximum, plural, =0 {caracteres} one {caractere} other {caracteres}}",
  "errors.too_big.string.inclusive": "Campo deve conter no máximo {maximum} {maximum, plural, =0 {caracteres} one {caractere} other {caracteres}}",
  "errors.too_big.string.not_inclusive": "Campo deve conter menos de {maximum} {maximum, plural, =0 {caracteres} one {caractere} other {caracteres}}",
  "errors.too_small.date.exact": "Data deve ser exatamente {minimum}",
  "errors.too_small.date.inclusive": "Data deve ser maior ou igual a {minimum}",
  "errors.too_small.date.not_inclusive": "Data deve ser maior que {minimum}",
  "errors.too_small.string.exact": "Campo deve conter exatamente {minimum} {minimum, plural, =0 {caracteres} one {caractere} other {caracteres}}",
  "errors.too_small.string.inclusive": "Campo deve conter no mínimo {minimum} {minimum, plural, =0 {caracteres} one {caractere} other {caracteres}}",
  "errors.too_small.string.not_inclusive": "Campo deve conter mais de {minimum} {minimum, plural, =0 {caracteres} one {caractere} other {caracteres}}",
  "notFoundContent.goBack": "Voltar",
  "errors.custom.only_numbers": "Campo deve conter apenas números",
  "errors.custom.uppercase_required": "O campo deve estar em maiúsculas e conter apenas letras",
  "common.noOptions": "Nenhuma opção encontrada.",
  "common.search": "Pesquisar...",
  "errors.too_big.number.inclusive": "Campo deve ser menor ou igual a {maximum}",
  "errors.too_small.number.not_inclusive": "Campo deve ser maior que {minimum}",
  "notFound.backToHome": "Voltar para Home",
  "notFound.description": "Tente acessar outra página.",
  "notFound.title": "A página que você está procurando não existe.",
  "common.actions": "Ações",
  "common.confirmDeletion": "Confirmar Exclusão",
  "common.copied": "Copiado para a área de transferência",
  "common.delete": "Excluir",
  "common.details": "Detalhes",
  "common.itemsPerPage": "Itens por página",
  "common.new.template": "Novo Template",
  "error.database.duplicatedMenu": "Menu já registrado",
  "error.database.invalidObject": "ID de objeto inválido",
  "error.database.notFound": "Não encontrado",
  "error.database.unexpected": "Erro inesperado",
  "error.database.validationFailed": "Validação falhou",
  "error.login": "Credenciais inválidas",
  "errors.auth.enforcementSubNotFound": "Nenhum subject foi encontrado para o 'sub' fornecido. Consulte a documentação de enforcement para orientação sobre o valor correto de 'sub'.",
  "errors.auth.grantTypeMissingFields": "O 'grant_type' fornecido está faltando campos obrigatórios. Consulte a documentação para orientação.",
  "errors.auth.internalServerError": "O servidor encontrou um erro inesperado. Tente novamente mais tarde ou entre em contato com o suporte.",
  "errors.auth.invalidClient": "O 'clientId' ou 'clientSecret' fornecido está incorreto. Verifique as credenciais e tente novamente.",
  "errors.auth.invalidGrantType": "O 'grantType' fornecido não é válido. Tipos de grant aceitos são password, client_credentials, refresh_token ou outros. Forneça um tipo válido.",
  "errors.auth.invalidMetadataNesting": "O objeto metadata não pode conter valores aninhados. Certifique-se de que o valor não esteja aninhado e tente novamente.",
  "errors.auth.invalidPathParameter": "Um ou mais parâmetros de caminho estão em formato incorreto. Verifique os parâmetros e certifique-se de que atendem ao formato exigido antes de tentar novamente.",
  "errors.auth.invalidQueryParameter": "Um ou mais parâmetros de consulta estão em formato incorreto. Verifique os parâmetros e certifique-se de que atendem ao formato exigido antes de tentar novamente.",
  "errors.auth.invalidRefreshToken": "O 'refreshToken' fornecido é inválido, expirado ou revogado. Verifique o token e tente novamente.",
  "errors.auth.invalidToken": "O token fornecido está expirado, inválido ou malformado. Forneça um token válido e tente novamente.",
  "errors.auth.invalidUsernameOrPassword": "O 'username' ou 'password' fornecido está incorreto. Verifique as credenciais e tente novamente.",
  "errors.auth.metadataKeyLengthExceeded": "A chave de metadata excede o comprimento máximo permitido de caracteres. Use uma chave mais curta.",
  "errors.auth.metadataValueLengthExceeded": "O valor de metadata excede o comprimento máximo permitido de caracteres. Use um valor mais curto.",
  "errors.auth.permissionEnforcementError": "O enforcer não está configurado adequadamente. Entre em contato com seu administrador se acredita que isso é um erro.",
  "errors.auth.tokenMissing": "Um token válido deve ser fornecido no cabeçalho da solicitação. Inclua um token e tente novamente.",
  "errors.auth.unsupportedGrantType": "O 'grantType' fornecido não é suportado por esta aplicação. Consulte os tipos de grant suportados pela aplicação.",
  "errors.midaz.accountAliasNotFound": "O Alias da conta fornecido não existe em nossos registros. Verifique o Alias da conta e tente novamente.",
  "errors.midaz.accountBalanceDeletionError": "Uma conta ou subconta não pode ser excluída se tiver saldo restante. Certifique-se de que todos os saldos restantes sejam transferidos para outra conta antes de tentar excluir.",
  "errors.midaz.accountIdNotFound": "O ID da conta fornecido não existe em nossos registros. Verifique o ID da conta e tente novamente.",
  "errors.midaz.accountIneligibilityError": "Uma ou mais contas listadas na transação não são elegíveis para participar. Revise os status das contas e tente novamente.",
  "errors.midaz.accountStatusTransactionRestriction": "Os status atuais das contas de origem e/ou destino não permitem transações. Altere o status da(s) conta(s) e tente novamente.",
  "errors.midaz.accountTypeImmutable": "O tipo de conta especificado não pode ser modificado. Certifique-se de que o tipo de conta correto está sendo usado e tente novamente.",
  "errors.midaz.actionNotPermitted": "A ação que você está tentando não é permitida no ambiente atual. Consulte a documentação para orientação.",
  "errors.midaz.aliasUnavailabilityError": "O alias já está em uso. Escolha um alias diferente e tente novamente.",
  "errors.midaz.assetCodeNotFound": "O código de asset fornecido não existe em nossos registros. Verifique o código de asset e tente novamente.",
  "errors.midaz.assetIdNotFound": "O ID de asset fornecido não existe em nossos registros. Verifique o ID de asset e tente novamente.",
  "errors.midaz.assetNameOrCodeDuplicate": "Um asset com o mesmo nome ou código já existe no seu ledger. Modifique o nome ou código do seu novo asset.",
  "errors.midaz.badRequest": "O servidor não pôde entender a solicitação devido à sintaxe malformada. Verifique os campos listados e tente novamente.",
  "errors.midaz.balanceCannotBeDeleted": "O saldo não pode ser excluído porque ainda há fundos nele.",
  "errors.midaz.balanceRemainingDeletionError": "O asset não pode ser excluído porque há saldo restante. Certifique-se de que todos os saldos sejam zerados antes de tentar excluir novamente.",
  "errors.midaz.balanceUpdateFailed": "O saldo não pôde ser atualizado para o ID de conta especificado. Verifique o ID da conta e tente novamente.",
  "errors.midaz.chartTypeNotFound": "O tipo de gráfico não existe. Forneça um tipo de gráfico válido e consulte a documentação se tiver dúvidas.",
  "errors.midaz.codeUpperCaseRequirement": "O código deve estar em maiúsculas. Certifique-se de que o código esteja em formato maiúsculo e tente novamente.",
  "errors.midaz.currencyCodeStandardCompliance": "Assets do tipo moeda devem estar em conformidade com o padrão ISO-4217. Use um código de moeda que esteja conforme as diretrizes ISO-4217.",
  "errors.midaz.dateRangeExceedsLimitError": "O intervalo entre 'initialDate' e 'finalDate' excede o limite permitido de meses. Ajuste as datas e tente novamente.",
  "errors.midaz.duplicateAssetPairError": "Um par para os assets já existe. Atualize a entrada existente em vez de criar uma nova.",
  "errors.midaz.duplicateIdempotencyKey": "A chave de idempotência já está em uso. Forneça uma chave única e tente novamente.",
  "errors.midaz.duplicateLedgerName": "Um ledger com este nome já existe na organização. Renomeie o ledger ou escolha uma organização diferente para anexá-lo.",
  "errors.midaz.duplicateSegmentNameError": "Um segmento com este nome já existe para este ledger. Tente novamente com um ledger ou nome diferente.",
  "errors.midaz.duplicateTransactionTemplateCodeError": "Um template de transação com este código já existe para seu ledger. Use um código diferente e tente novamente.",
  "errors.midaz.entityNotFound": "Nenhuma entidade foi encontrada para o ID fornecido. Certifique-se de usar o ID correto para a entidade que está tentando gerenciar.",
  "errors.midaz.externalAccountModificationProhibited": "Contas do tipo 'external' não podem ser excluídas ou modificadas, pois são usadas para rastreabilidade com sistemas externos. Revise sua solicitação e certifique-se de que as operações sejam realizadas apenas em contas internas.",
  "errors.midaz.failedToRetrieveAccountsByAliases": "As contas não puderam ser recuperadas usando os aliases especificados. Verifique os aliases quanto à precisão e tente novamente.",
  "errors.midaz.idCannotBeUsedAsParentId": "O ID fornecido não pode ser usado como ID pai. Escolha um diferente.",
  "errors.midaz.immutableFieldError": "O campo não pode ser modificado. Remova este campo da sua solicitação e tente novamente.",
  "errors.midaz.inactiveAccountTypeError": "O tipo de conta especificado não pode ser definido como INACTIVE. Certifique-se de que o tipo de conta correto está sendo usado e tente novamente.",
  "errors.midaz.insufficientAccountBalanceError": "A conta não tem saldo suficiente. Tente novamente com um valor menor ou igual ao saldo disponível.",
  "errors.midaz.insufficientFundsError": "A transação não pôde ser concluída devido a fundos insuficientes na conta. Adicione fundos suficientes à sua conta e tente novamente.",
  "errors.midaz.insufficientPrivileges": "Você não tem as permissões necessárias para realizar esta ação. Entre em contato com seu administrador se acredita que isso é um erro.",
  "errors.midaz.internalServerError": "O servidor encontrou um erro inesperado. Tente novamente mais tarde ou entre em contato com o suporte.",
  "errors.midaz.invalidAccountAlias": "O alias contém caracteres inválidos. Verifique o valor do alias e tente novamente.",
  "errors.midaz.invalidAccountType": "O 'type' fornecido não é válido. Tipos aceitos são: deposit, savings, loans, marketplace, creditCard ou external. Forneça um tipo válido.",
  "errors.midaz.invalidCodeFormat": "O campo 'code' deve ser alfanumérico, em maiúsculas, e deve conter pelo menos uma letra. Forneça um código válido.",
  "errors.midaz.invalidCountryCode": "O código de país fornecido no campo 'address.country' não está em conformidade com o padrão ISO-3166 alpha-2. Forneça um código de país alpha-2 válido.",
  "errors.midaz.invalidDateFormatError": "A 'initialDate', 'finalDate', ou ambas estão no formato incorreto. Use o formato 'yyyy-mm-dd' e tente novamente.",
  "errors.midaz.invalidDateRangeError": "Ambos os campos 'initialDate' e 'finalDate' são obrigatórios e devem estar no formato 'yyyy-mm-dd'. Forneça datas válidas e tente novamente.",
  "errors.midaz.invalidFinalDateError": "A 'finalDate' não pode ser anterior à 'initialDate'. Verifique as datas e tente novamente.",
  "errors.midaz.invalidMetadataNesting": "O objeto metadata não pode conter valores aninhados. Certifique-se de que o valor não esteja aninhado e tente novamente.",
  "errors.midaz.invalidParentAccountId": "O ID da conta pai especificado não existe. Verifique se o ID está correto e tente sua solicitação novamente.",
  "errors.midaz.invalidPathParameter": "O parâmetro de caminho fornecido não está no formato esperado. Certifique-se de que o parâmetro atenda ao formato exigido e tente novamente.",
  "errors.midaz.invalidQueryParameter": "Um ou mais parâmetros de consulta estão em formato incorreto. Certifique-se de que atendem ao formato exigido antes de tentar novamente.",
  "errors.midaz.invalidScriptFormatError": "O script fornecido em sua solicitação é inválido ou está em formato não suportado. Verifique o formato do script e tente novamente.",
  "errors.midaz.invalidSortOrder": "O campo 'sort_order' deve ser 'asc' ou 'desc'. Forneça uma ordem de classificação válida e tente novamente.",
  "errors.midaz.invalidToken": "O token fornecido é inválido ou malformado. Forneça um token válido e tente novamente.",
  "errors.midaz.invalidType": "O 'type' fornecido não é válido. Tipos aceitos são: currency, crypto, commodities, ou others. Forneça um tipo válido.",
  "errors.midaz.ledgerIdNotFound": "O ID de ledger fornecido não existe em nossos registros. Verifique o ID de ledger e tente novamente.",
  "errors.midaz.ledgerNameConflict": "Um ledger com este nome já existe na organização. Renomeie o ledger ou escolha uma organização diferente para anexá-lo.",
  "errors.midaz.messageBrokerUnavailable": "O servidor encontrou um erro inesperado ao conectar com o Message Broker. Tente novamente mais tarde ou entre em contato com o suporte.",
  "errors.midaz.metadataKeyLengthExceeded": "A chave de metadata excede o comprimento máximo permitido de 100 caracteres. Use uma chave mais curta.",
  "errors.midaz.metadataValueLengthExceeded": "O valor de metadata excede o comprimento máximo permitido de 100 caracteres. Use um valor mais curto.",
  "errors.midaz.mismatchedAssetCode": "O ID da conta pai fornecido está associado a um código de asset diferente do especificado em sua solicitação. Certifique-se de que o código de asset corresponda ao da conta pai, ou use um ID de conta pai diferente e tente novamente.",
  "errors.midaz.missingFieldsInRequest": "Sua solicitação está faltando um ou mais campos obrigatórios. Consulte a documentação para garantir que todos os campos necessários estejam incluídos em sua solicitação.",
  "errors.midaz.noAccountIdsProvided": "Nenhum ID de conta foi fornecido para a atualização de saldo. Forneça IDs de conta válidos e tente novamente.",
  "errors.midaz.noAccountsFound": "Nenhuma conta foi encontrada para os IDs de conta fornecidos. Verifique os IDs de conta e tente novamente.",
  "errors.midaz.noAccountsFoundSearch": "Nenhuma conta foi encontrada na pesquisa. Revise os critérios de pesquisa e tente novamente.",
  "errors.midaz.noAssetsFound": "Nenhum asset foi encontrado na pesquisa. Revise os critérios de pesquisa e tente novamente.",
  "errors.midaz.noLedgersFound": "Nenhum ledger foi encontrado na pesquisa. Revise os critérios de pesquisa e tente novamente.",
  "errors.midaz.noOperationsFound": "Nenhuma operação foi encontrada na pesquisa. Revise os critérios de pesquisa e tente novamente.",
  "errors.midaz.noOrganizationsFound": "Nenhuma organização foi encontrada na pesquisa. Revise os critérios de pesquisa e tente novamente.",
  "errors.midaz.noPortfoliosFound": "Nenhum portfólio foi encontrado na pesquisa. Revise os critérios de pesquisa e tente novamente.",
  "errors.midaz.noSegmentsFound": "Nenhum segmento foi encontrado na pesquisa. Revise os critérios de pesquisa e tente novamente.",
  "errors.midaz.noTransactionsFound": "Nenhuma transação foi encontrada na pesquisa. Revise os critérios de pesquisa e tente novamente.",
  "errors.midaz.operationIdNotFound": "O ID de operação fornecido não existe em nossos registros. Verifique o ID de operação e tente novamente.",
  "errors.midaz.organizationIdNotFound": "O ID de organização fornecido não existe em nossos registros. Verifique o ID de organização e tente novamente.",
  "errors.midaz.overflowError": "A solicitação não pôde ser concluída devido a um overflow. Verifique os valores e tente novamente.",
  "errors.midaz.paginationLimitExceeded": "O limite de paginação excede o máximo permitido de itens por página. Verifique o limite e tente novamente.",
  "errors.midaz.parentOrganizationIdNotFound": "O ID da organização pai fornecido não existe em nossos registros. Verifique o ID da organização pai e tente novamente.",
  "errors.midaz.parentTransactionIdNotFound": "O parentTransactionId não corresponde a nenhuma transação existente. Revise o ID e tente novamente.",
  "errors.midaz.permissionEnforcementError": "O enforcer não está configurado adequadamente. Entre em contato com seu administrador se acredita que isso é um erro.",
  "errors.midaz.portfolioIdNotFound": "O ID de portfólio fornecido não existe em nossos registros. Verifique o ID de portfólio e tente novamente.",
  "errors.midaz.raceConditioningDetected": "Uma condição de corrida foi detectada ao processar sua solicitação. Tente novamente.",
  "errors.midaz.resourceAlreadyDeleted": "O recurso que você está tentando excluir já foi excluído. Certifique-se de que está usando o ID correto e tente novamente.",
  "errors.midaz.segmentIdInactive": "O ID de Segmento que você está tentando usar está inativo. Use outro ID de Segmento e tente novamente.",
  "errors.midaz.segmentIdNotFound": "O ID de segmento fornecido não existe em nossos registros. Verifique o ID de segmento e tente novamente.",
  "errors.midaz.tokenExpired": "O token fornecido expirou. Forneça um token válido e tente novamente.",
  "errors.midaz.tokenMissing": "Um token válido deve ser fornecido no cabeçalho da solicitação. Inclua um token e tente novamente.",
  "errors.midaz.transactionAmbiguousAccount": "A transação não pode usar a mesma conta nas origens e destinos.",
  "errors.midaz.transactionCantBeReverted": "A transação não pode ser revertida. Tente novamente.",
  "errors.midaz.transactionIdNotFound": "O ID de transação fornecido não existe em nossos registros. Verifique o ID de transação e tente novamente.",
  "errors.midaz.transactionIsAlreadyReversal": "A transação já é uma reversão. Tente novamente.",
  "errors.midaz.transactionMethodRestriction": "Transações envolvendo este código de asset não são permitidas para a origem e/ou destino especificados. Tente novamente usando contas que permitam transações com o código de asset.",
  "errors.midaz.transactionRevertAlreadyExist": "A reversão da transação já existe. Tente novamente.",
  "errors.midaz.transactionValueMismatch": "Os valores para a origem, o destino, ou ambos não correspondem ao valor da transação especificado. Verifique os valores e tente novamente.",
  "errors.midaz.unexpectedFieldsInTheRequest": "O corpo da solicitação contém mais campos do que o esperado. Envie apenas os campos permitidos conforme a documentação. Os campos inesperados estão listados no objeto fields.",
  "errors.midaz.unmodifiableFieldError": "Sua solicitação inclui um campo que não pode ser modificado. Revise sua solicitação e tente novamente, removendo quaisquer campos não editáveis. Consulte a documentação para orientação.",
  "fileInput.chooseFile": "Escolher Arquivo",
  "fileInput.fileSize.bytes": "{bytes} B",
  "fileInput.fileSize.kilobytes": "{kb} KB",
  "fileInput.fileSize.megabytes": "{mb} MB",
  "fileInput.noFileChosen": "Nenhum arquivo escolhido",
  "notAuthorized.backToHome": "Voltar ao Início",
  "notAuthorized.title": "Você não está autorizado a acessar esta página.",
  "smartTemplates.cards.docs.action": "Ler a Documentação",
  "smartTemplates.cards.docs.description": "Precisa de ajuda ou documentação adicional? Estamos aqui para ajudar.",
  "smartTemplates.cards.docs.title": "Documentação Smart Template",
  "smartTemplates.cards.reports.action": "Gerenciar Relatórios",
  "smartTemplates.cards.reports.description": "Aqui estão os relatórios, o resultado do processamento de dados através de templates.",
  "smartTemplates.cards.reports.title": "Relatórios",
  "smartTemplates.cards.templates.action": "Gerenciar Templates",
  "smartTemplates.cards.templates.description": "Aqui estão os templates que você criou e carregou no domínio do Plugin.",
  "smartTemplates.cards.templates.title": "Templates",
  "smartTemplates.header.about": "Sobre",
  "smartTemplates.tabs.overview": "Visão Geral",
  "smartTemplates.tabs.reports": "Relatórios",
  "smartTemplates.tabs.templates": "Templates",
  "smartTemplates.title": "Smart Templates",
  "table.pagination.next": "Próximo",
  "table.pagination.previous": "Anterior",
  "templates.delete.description": "Tem certeza de que deseja excluir o template \"{fileName}\"? Esta ação não pode ser desfeita.",
  "templates.emptyState.description": "Você ainda não criou nenhum template. Crie seu primeiro template para começar.",
  "templates.emptyState.title": "Nenhum template encontrado",
  "templates.field.lastModified": "Última Modificação",
  "templates.field.name": "Nome",
  "templates.field.type": "Tipo",
  "templates.form.mandatoryFields": "(*) campos obrigatórios",
  "templates.form.outputFormat": "Formatos de Saída",
  "templates.form.outputFormat.description": "Selecione o formato de saída.",
  "templates.form.outputFormat.tooltip": "Define o formato de saída para o relatório gerado, como HTML, TXT, etc.",
  "templates.form.saveButton": "Salvar",
  "templates.form.templateFile": "Arquivo de Template (.tpl)",
  "templates.form.templateFile.description": "Faça upload de um arquivo de template com sua lógica de negócio e formatação.",
  "templates.form.templateFile.tooltip": "Faça upload de um arquivo de template com sua lógica de negócio e formatação",
  "templates.form.templateName": "Nome do Template",
  "templates.form.templateName.tooltip": "Digite um nome descritivo para seu template",
  "templates.listingTemplate.addButton": "Novo Template",
  "templates.sheet.description": "Faça upload de um arquivo de template e configure suas definições para geração de relatórios.",
  "templates.sheet.title": "Detalhes do Template",
  "templates.showing": "{number, plural, =0 {Nenhum template encontrado} one {Mostrando {count} template} other {Mostrando {count} templates}}.",
  "templates.subtitle": "Gerencie seus templates de relatório e suas configurações.",
  "templates.title": "Templates",
  "templates.tooltip": "Templates são estruturas de relatório pré-configuradas que ajudam a padronizar e automatizar como os dados são apresentados. Você pode definir layouts, formatos e parâmetros para agilizar a geração de relatórios e garantir consistência.",
  "common.searchPlaceholder": "Pesquisar...",
  "error.query.title": "Erro do Servidor",
  "error.smartTemplates.unknownError": "Erro desconhecido ocorreu no serviço Smart Templates.",
  "errors.template.file.empty": "O arquivo não pode estar vazio",
  "errors.template.file.invalid_extension": "O arquivo deve ser um arquivo de template .tpl",
  "errors.template.file.required": "Arquivo de template é obrigatório",
  "errors.template.file.too_large": "O tamanho do arquivo deve ser menor que 5MB",
  "reports.actions.download": "Baixar Relatório",
  "reports.actions.downloadNotAvailable": "Download Não Disponível",
  "reports.actions.newReport": "Novo Relatório",
  "reports.create.success": "Novo Relatório iniciado com sucesso",
  "reports.download.success.description": "Seu relatório foi baixado com sucesso.",
  "reports.download.success.title": "Download Concluído",
  "reports.downloading": "Baixando...",
  "reports.empty.action": "Novo Relatório",
  "reports.empty.description": "Gere seu primeiro relatório a partir de um template para começar.",
  "reports.empty.title": "Nenhum relatório ainda",
  "reports.filters.database": "Banco de Dados",
  "reports.filters.database.tooltip": "Selecione o banco de dados para filtrar",
  "reports.filters.description": "Defina os critérios de filtragem aplicados aos dados usados no relatório",
  "reports.filters.field": "Campo",
  "reports.filters.field.tooltip": "Selecione o campo para filtrar por",
  "reports.filters.table": "Tabela",
  "reports.filters.table.tooltip": "Selecione a tabela para filtrar",
  "reports.filters.values": "Valores",
  "reports.filters.values.description": "Use separação por vírgula para indicar múltiplos valores",
  "reports.filters.values.tooltip": "Digite os valores para filtrar por",
  "reports.form.generateButton": "Gerar Relatório",
  "reports.form.ledgerIds": "IDs de Ledger",
  "reports.form.ledgerIds.description": "Use separação por vírgula para indicar múltiplos valores",
  "reports.form.ledgerIds.tooltip": "Digite IDs de ledger para o relatório",
  "reports.form.mandatoryFields": "(*) campos obrigatórios",
  "reports.form.template": "Selecionar template",
  "reports.form.template.tooltip": "Escolha um template para geração do relatório",
  "reports.loading": "Carregando relatórios...",
  "reports.pagination.info": "Mostrando {count} {count, plural, one {relatório} other {relatórios}}.",
  "reports.sheet.description": "Faça upload de um arquivo de template e configure suas definições para geração de relatórios.",
  "reports.sheet.tab.details": "Detalhes do Relatório",
  "reports.sheet.tab.filters": "Filtros",
  "reports.sheet.title": "Novo Relatório",
  "reports.status.failed": "Falhou",
  "reports.status.finished": "Finalizado",
  "reports.status.processing": "Processando",
  "reports.subtitle": "Crie e gerencie relatórios, o resultado do processamento de dados através de templates.",
  "reports.title": "Relatórios",
  "reports.tooltip": "Relatórios são documentos gerados que transformam seus dados de ledger usando templates. Você pode criar relatórios para conformidade, análise ou fins de exportação de dados.",
  "smartTemplates.breadcrumb.smartTemplates": "Smart Templates",
  "table.toast.copyId": "O id foi copiado para sua área de transferência.",
  "templates.create.success": "Novo Template {name} criado com sucesso",
  "templates.delete.success": "Template excluído com sucesso",
  "templates.update.success": "Template {name} atualizado com sucesso",
  "common.outputFormatPlaceholder": "Selecione o formato de saída...",
  "reports.actions.downloadSuccess": "Relatório baixado com sucesso",
  "reports.actions.viewModeGrid": "Visualização em Grade",
  "reports.actions.viewModeTable": "Visualização em Tabela",
  "reports.empty.message": "Nenhum relatório encontrado",
  "reports.table.completedAt": "Concluído em",
  "reports.table.format": "Formato",
  "reports.table.name": "Nome",
  "reports.table.reportId": "ID do Relatório",
  "reports.table.status": "Status",
  "smartTemplates.about.description": "Smart Templates permite criar e gerenciar templates de relatórios personalizados para transformar seus dados de ledger em documentos formatados.",
  "smartTemplates.about.dismiss": "Dispensar",
  "smartTemplates.about.readDocs": "Ler Documentação",
  "smartTemplates.about.title": "Sobre Smart Templates",
  "smartTemplates.breadcrumb.overview": "Visão Geral",
  "smartTemplates.breadcrumb.reports": "Relatórios",
  "smartTemplates.breadcrumb.templates": "Templates"
}